In [1]:
import pandas as pd

In [2]:
actor=pd.read_csv('../data/actor.csv')
category=pd.read_csv('../data/category.csv')
film=pd.read_csv('../data/film.csv')
inventory=pd.read_csv('../data/inventory.csv')
language=pd.read_csv('../data/language.csv')
old_HDD=pd.read_csv('../data/old_HDD.csv')
rental=pd.read_csv('../data/rental.csv')

# Limpieza columna actor

In [3]:
nan_cols = actor.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [4]:
actor.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [5]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
actor = actor.drop(['last_update'], axis=1)

In [6]:
#Cambiamos el formato ya que nos aparecían todas las letras en mayúsculas
actor.first_name = actor.first_name.str.capitalize()
actor.last_name = actor.last_name.str.capitalize()

In [7]:
#comprobamos si existen actores duplicados
actor[['first_name','last_name']].duplicated().sum()

1

In [8]:
# Eliminamos el registro duplicado y corregimos índices
act_index = actor[actor[['first_name','last_name']].duplicated()].index
actor = actor.drop(index= act_index).reset_index(drop= True)

In [9]:
actor.head()

   actor_id first_name     last_name
0         1   Penelope       Guiness
1         2       Nick      Wahlberg
2         3         Ed         Chase
3         4   Jennifer         Davis
4         5     Johnny  Lollobrigida

# Limpieza columna category

In [10]:
nan_cols = category.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [11]:
category.last_update.value_counts()

2006-02-15 04:46:27    16
Name: last_update, dtype: int64

In [12]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
category = category.drop(['last_update'], axis=1)

In [13]:
category.head(16)

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

# Limpieza columna film

In [14]:
nan_cols = film.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

original_language_id    100.0
dtype: float64

In [15]:
#eliminamos la columna de 'original_language_id' ya que está llena de nulos
film = film.drop(['original_language_id'], axis=1)

In [16]:
film.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [17]:
film.last_update.value_counts()

2006-02-15 05:03:42    1000
Name: last_update, dtype: int64

In [18]:
film.language_id.value_counts()

1    1000
Name: language_id, dtype: int64

In [19]:
#eliminamos la columna de 'release_year' ya que todas las películas son del 2006.
film = film.drop(['release_year'], axis=1)

In [20]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
film = film.drop(['last_update'], axis=1)

In [21]:
# 1 equivale a English, de la tabla id_language, todas las películas son en inglés
film['language_id'].replace(1, 'English', inplace= True)

In [22]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes

# Limpieza columna inventory

In [23]:
nan_cols = inventory.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [24]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
inventory = inventory.drop(['last_update'], axis=1)

In [25]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# Limpieza columna language

In [26]:
nan_cols = language.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [27]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
language = language.drop(['last_update'], axis=1)

In [28]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

# Limpieza columna old_HDD

In [29]:
nan_cols = old_HDD.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [30]:
#eliminamos la columna de 'release_year' ya que todas son del mismo año
old_HDD = old_HDD.drop(['release_year'], axis=1)

In [31]:
#Cambiamos el formato ya que nos aparecían todas las letras en mayúsculas
old_HDD.first_name = old_HDD.first_name.str.capitalize()
old_HDD.last_name = old_HDD.last_name.str.capitalize()

In [32]:
old_HDD.head(15)

   first_name last_name                  title  category_id
0    Penelope   Guiness       ACADEMY DINOSAUR            6
1    Penelope   Guiness   ANACONDA CONFESSIONS            2
2    Penelope   Guiness            ANGELS LIFE           13
3    Penelope   Guiness  BULWORTH COMMANDMENTS           10
4    Penelope   Guiness          CHEAPER CLYDE           14
5    Penelope   Guiness     COLOR PHILADELPHIA            4
6    Penelope   Guiness        ELEPHANT TROJAN           11
7    Penelope   Guiness    GLEAMING JAWBREAKER           15
8    Penelope   Guiness         HUMAN GRAFFITI           10
9    Penelope   Guiness         KING EVOLUTION            8
10   Penelope   Guiness             LADY STAGE           11
11   Penelope   Guiness        LANGUAGE COWBOY            3
12   Penelope   Guiness       MULHOLLAND BEAST            9
13   Penelope   Guiness       OKLAHOMA JUMANJI           13
14   Penelope   Guiness            RULES HUMAN           11

# Limpieza columna rental

In [33]:
nan_cols = rental.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [34]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
rental = rental.drop(['last_update'], axis=1)

In [35]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

# Reorganización de tablas

In [36]:
#añadimos la categoría a old_HDD para que sea más completa
old_HDD = old_HDD.merge(category, left_on='category_id', right_on='category_id', how='left')

In [37]:
old_HDD.columns = ['first_name','last_name','title','category_id', 'category']

In [38]:
old_HDD.head()

  first_name last_name                  title  category_id     category
0   Penelope   Guiness       ACADEMY DINOSAUR            6  Documentary
1   Penelope   Guiness   ANACONDA CONFESSIONS            2    Animation
2   Penelope   Guiness            ANGELS LIFE           13          New
3   Penelope   Guiness  BULWORTH COMMANDMENTS           10        Games
4   Penelope   Guiness          CHEAPER CLYDE           14       Sci-Fi

In [39]:
#vamos a añadir las categorías de cada película a través de old_HDD
film = film.merge(old_HDD, on='title', how='left')
film = film.drop(['first_name', 'last_name'], axis=1)

#eliminamos los duplicados que hayan podido salir con el join
film = film.drop_duplicates()

In [40]:
#eliminamos la columna de 'category', con tener el nombre el id es suficiente
film = film.drop(['category'], axis=1)

In [41]:
film['category_id'] = film['category_id'].fillna(-1)  #rellenamos los nulos con -1

In [1]:
film['category_id'] = film['category_id'].astype(int)  #cambiamos el tipo de float a string

In [43]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [47]:
#estamos teniendo problemas porque el número de registros no coinciden
rental = rental[rental['inventory_id'] <= 1000]

In [49]:
old_HDD.head()

  first_name last_name                  title  category_id     category
0   Penelope   Guiness       ACADEMY DINOSAUR            6  Documentary
1   Penelope   Guiness   ANACONDA CONFESSIONS            2    Animation
2   Penelope   Guiness            ANGELS LIFE           13          New
3   Penelope   Guiness  BULWORTH COMMANDMENTS           10        Games
4   Penelope   Guiness          CHEAPER CLYDE           14       Sci-Fi

In [50]:
old_HDD.head()

  first_name last_name                  title  category_id     category
0   Penelope   Guiness       ACADEMY DINOSAUR            6  Documentary
1   Penelope   Guiness   ANACONDA CONFESSIONS            2    Animation
2   Penelope   Guiness            ANGELS LIFE           13          New
3   Penelope   Guiness  BULWORTH COMMANDMENTS           10        Games
4   Penelope   Guiness          CHEAPER CLYDE           14       Sci-Fi

In [51]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [72]:
#old_hdd va a ser la key que una actores y películas, para ello tenemos que meterle las columnas de film_id y de actor_id
old_HDD = old_HDD.merge(film, on='title', how='left')

old_HDD = old_HDD.drop(['title', 'category_id_x', 'category', 'description','language_id', 'rental_duration', 'rental_rate', 'length', 'replacement_cost','rating','special_features','category_id_y'], axis=1)

# old_HDD = old_HDD.drop_duplicates()  #eliminamos los duplicados que hayan podido salir con el join

In [78]:
old_HDD

    first_name last_name  film_id              name
0     Penelope   Guiness        1  Penelope Guiness
1     Penelope   Guiness       23  Penelope Guiness
2     Penelope   Guiness       25  Penelope Guiness
3     Penelope   Guiness      106  Penelope Guiness
4     Penelope   Guiness      140  Penelope Guiness
..         ...       ...      ...               ...
995     Goldie     Brody      168      Goldie Brody
996     Goldie     Brody      203      Goldie Brody
997     Goldie     Brody      222      Goldie Brody
998     Goldie     Brody      290      Goldie Brody
999     Goldie     Brody      293      Goldie Brody

[1000 rows x 4 columns]

In [4]:
# old_HDD = old_HDD.merge(actor, on='name', how='left')

In [81]:
old_HDD = old_HDD.drop(['first_name', 'last_name'], axis=1)

In [85]:
# vamos a añadir las categorías de cada película a través de old_HDD
# old_HDD = old_HDD.merge(actor, on='name', how='left')
old_HDD = old_HDD.drop(['name', 'first_name', 'last_name'], axis=1)

# #eliminamos los duplicados que hayan podido salir con el join
# old_HDD = old_HDD.drop_duplicates()

In [86]:
old_HDD

     film_id  actor_id
0          1         1
1         23         1
2         25         1
3        106         1
4        140         1
..       ...       ...
995      168        39
996      203        39
997      222        39
998      290        39
999      293        39

[1000 rows x 2 columns]

In [93]:
old_HDD['id'] = old_HDD.reset_index().index + 1

In [95]:
old_HDD

     film_id  actor_id    id
0          1         1     1
1         23         1     2
2         25         1     3
3        106         1     4
4        140         1     5
..       ...       ...   ...
995      168        39   996
996      203        39   997
997      222        39   998
998      290        39   999
999      293        39  1000

[1000 rows x 3 columns]

In [76]:
old_HDD['name'] = old_HDD['first_name'] + ' ' + old_HDD['last_name']

In [77]:
actor['name'] = actor['first_name'] + ' ' + actor['last_name']

guardamos los archivos limpios

In [96]:
# actor.to_csv('../data/actor_clean.csv', index=False)
# category.to_csv('../data/category_clean.csv', index=False)
# film.to_csv('../data/film_clean.csv', index=False)
# inventory.to_csv('../data/inventory_clean.csv', index=False)
# language.to_csv('../data/language_clean.csv', index=False)
# old_HDD.to_csv('../data/old_HDD_clean.csv', index=False)
# rental.to_csv('../data/rental_clean.csv', index=False)